
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для каждого СтрокаСотрудника Из ЭтотОбъект.СписокСотрудников Цикл
		СтрокаСотрудника.Оклад = РегистрыСведений.СведенияОбОкладахСотрудников.ПолучитьОклад(СтрокаСотрудника.Сотрудник, ЭтотОбъект.Дата);	
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Зарплата
	Движения.Зарплата.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников Из ЭтотОбъект.СписокСотрудников Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВидыРасчёта.Оклад;
		Движение.ПериодДействияНачало = НачалоМесяца(ЭтотОбъект.Дата);
		Движение.ПериодДействияКонец = КонецМесяца(ЭтотОбъект.Дата);
		Движение.ПериодРегистрации = ЭтотОбъект.Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Оклад = ТекСтрокаСписокСотрудников.Оклад;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ  
	Движения.Зарплата.Записать();
	Движения.Зарплата.Рассчитать();
КонецПроцедуры
