Функция ПолучитьОклад(СотрудникОтбора, ПериодОтбора) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведениеОбОкладахСотрудниковСрезПоследних.Оклад КАК Оклад
		|ИЗ
		|	РегистрСведений.СведенияОбОкладахСотрудников.СрезПоследних(&ПериодСреза, Сотрудник = &СотрудникОтбора) КАК СведениеОбОкладахСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("ПериодСреза", ПериодОтбора);
	Запрос.УстановитьПараметр("СотрудникОтбора", СотрудникОтбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОкладСотрудника = 0;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ОкладСотрудника = ВыборкаДетальныеЗаписи.Оклад;
		
	КонецЕсли;   
	
	Возврат ОкладСотрудника;	
	
КонецФункции // ()
