&НаКлиенте
Процедура ЗаполнитьСписокДней(Команда)
	Если Объект.ДатаНачала = '0001-01-01' ИЛИ Объект.ДатаОкончания = '0001-01-01' Тогда
	
		Сообщить("Интервал не указан");
		ЭтотОбъект.ТекущийЭлемент = Элементы.ДатаНачала;
		Возврат;
	КонецЕсли;	
	
	Объект.СписокДней.Очистить();
	
	ТекущийДень = Объект.ДатаНачала;
	
	Пока ТекущийДень <= Объект.ДатаОкончания Цикл
		
		НоваяСтр = Объект.СписокДней.Добавить();
		НоваяСтр.Дата = ТекущийДень;
		НоваяСтр.Рабочий = (ДеньНедели(НоваяСтр.Дата) < 6);
		
		НоваяСтр.КоличествоЧасов = Объект.НормаЧасов;
		ТекущийДень = ТекущийДень + 86400;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеКалендаряНаСервере()
	Отбор = Новый Структура("Рабочий", Истина);
	ТаблицаГрафика = Объект.СписокДней.НайтиСтроки(Отбор);
	РегистрыСведений.РабочийГрафик.ЗаполнитьГрафикПоТаблице(ТаблицаГрафика);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеКалендаря(Команда)
	Если Объект.СписокДней.Количество() = 0 Тогда
		Сообщить("Нет данных для импорта");
		Возврат;
	КонецЕсли;
	ЗагрузитьДанныеКалендаряНаСервере();
КонецПроцедуры
