
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    ОбъектФормы = ЭтотОбъект.Объект; 
    Если Не ПустаяСтрока(ОбъектФормы.Фамилия) Тогда
        Результат = ОбъектФормы.Фамилия;
    КонецЕсли;
    
    Если Не ПустаяСтрока(ОбъектФормы.Имя) Тогда
        Результат = Результат + " " + Лев(ОбъектФормы.Имя, 1) + ".";
    КонецЕсли;
    
    Если Не ПустаяСтрока(ОбъектФормы.Отчество) Тогда
        Результат = Результат + Лев(ОбъектФормы.Отчество, 1) + ".";
    КонецЕсли;
    
    ОбъектФормы.Наименование = СокрЛП(Результат);
КонецПроцедуры
